# YOLO11 + PVRP-Lite: Full PVRP + Selective Slimming
# P2Proxy + ProxyFuse + NDA + C3k2Lite at P4/P5 neck
# Keep C3k2 at P3 path (layer 16) for small object capacity

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]     # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]    # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]    # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]   # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]      # 9
  - [-1, 2, C2PSA, [1024]]        # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]     # cat backbone P4
  - [-1, 2, C3k2Lite, [512, False]]   # 13 — SLIMMED (P5→P4 upsample)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]     # cat backbone P3
  - [-1, 2, C3k2, [256, False]]   # 15 — KEPT (P3 small object path)

  # --- PVRP: P2Proxy + ProxyFuse ---
  - [[1], 1, P2Proxy, [256, 1]]   # 16
  - [[-1, 15], 1, ProxyFuse, [256, 4]]  # 17

  - [-1, 1, Conv, [256, 3, 2]]    # 18
  - [[-1, 13], 1, Concat, [1]]    # 19
  - [-1, 2, C3k2Lite, [512, False]]   # 20 — SLIMMED (P4 head)

  - [-1, 1, Conv, [512, 3, 2]]    # 21
  - [[-1, 10], 1, Concat, [1]]    # 22
  - [-1, 2, C3k2Lite, [1024, True]]   # 23 — SLIMMED (P5 head)

  # --- PVRP: NDA ---
  - [[17], 1, NDA, [256]]         # 24
  - [[20], 1, NDA, [512]]         # 25
  - [[23], 1, NDA, [1024]]        # 26

  - [[24, 25, 26], 1, Detect, [nc]]
