# YOLO11 + PVRP-S3: Only NDA (no P2Proxy, no ProxyFuse)

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]     # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]    # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]    # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]   # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]      # 9
  - [-1, 2, C2PSA, [1024]]        # 10

# Standard neck + NDA before Detect
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]     # cat backbone P4
  - [-1, 2, C3k2, [512, False]]   # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]     # cat backbone P3
  - [-1, 2, C3k2, [256, False]]   # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]    # cat head P4
  - [-1, 2, C3k2, [512, False]]   # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]    # cat head P5
  - [-1, 2, C3k2, [1024, True]]   # 21 (P5/32-large)

  # --- NDA on each detection scale ---
  - [[15], 1, NDA, [256]]         # 22: NDA on P3 -> 128ch
  - [[18], 1, NDA, [512]]         # 23: NDA on P4 -> 256ch
  - [[21], 1, NDA, [1024]]        # 24: NDA on P5 -> 512ch

  - [[22, 23, 24], 1, Detect, [nc]]
