# YOLO11 + PVRP-Lite-S4: Selective Slimming Only (no PVRP, no NDA)
# C3k2Lite at P4/P5 neck, keep C3k2 at P3 path
# Tests slimming contribution independently

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]     # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]    # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]    # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]   # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]      # 9
  - [-1, 2, C2PSA, [1024]]        # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]     # cat backbone P4
  - [-1, 2, C3k2Lite, [512, False]]   # 13 — SLIMMED

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]     # cat backbone P3
  - [-1, 2, C3k2, [256, False]]   # 15 — KEPT (P3 path)

  - [-1, 1, Conv, [256, 3, 2]]    # 16
  - [[-1, 13], 1, Concat, [1]]    # 17
  - [-1, 2, C3k2Lite, [512, False]]   # 18 — SLIMMED (P4 head)

  - [-1, 1, Conv, [512, 3, 2]]    # 19
  - [[-1, 10], 1, Concat, [1]]    # 20
  - [-1, 2, C3k2Lite, [1024, True]]   # 21 — SLIMMED (P5 head)

  - [[15, 18, 21], 1, Detect, [nc]]
